// dz6_standard_fraction.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "Fraction.h"

int main()
{
	setlocale(LC_ALL, "Russian");  // чтобы русский язык при печати верно выводился
	/*Fraction d(6, 9);
	d.f(1, 2);*/
	Fraction e();
	/*Fraction a(6, 3);
	Fraction b(1, 4);
	std::cout << "a = " << a << ", b = " << b << std::endl;
	std::cout << "a + b = " << a + b  << std::endl;
	std::cout << "a - b = " << a - b << std::endl;
	std::cout << "a * b = " << a * b << std::endl;
	std::cout << "a / b = " << a / b << std::endl;
	//std::cout << "a + 1 = " << a + 1 << std::endl;*/
	Fraction c();
	//std::cout << "c = " << b.numerator <<  std::endl;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
